grevaillot/svd_tools/headers/STM32F3x4/hrtim_common.h
/** HRTIM_Common_BMCR_BMOM Burst Mode operating mode **/
#define HRTIM_Common_BMCR_BMOM		(1 << 1)
/** HRTIM_Common_BMCR_BME Burst Mode enable **/
#define HRTIM_Common_BMCR_BME		(1 << 0)

/**@}*/

/** @defgroup hrtim_common_bmtrgr BMTRGR BMTRGR
@{*/

/** HRTIM_Common_BMTRGR_OCHPEV OCHPEV **/
#define HRTIM_Common_BMTRGR_OCHPEV		(1 << 31)
/** HRTIM_Common_BMTRGR_EEV8 EEV8 **/
#define HRTIM_Common_BMTRGR_EEV8		(1 << 30)
/** HRTIM_Common_BMTRGR_EEV7 EEV7 **/
#define HRTIM_Common_BMTRGR_EEV7		(1 << 29)
/** HRTIM_Common_BMTRGR_TDEEV8 TDEEV8 **/
#define HRTIM_Common_BMTRGR_TDEEV8		(1 << 28)
/** HRTIM_Common_BMTRGR_TAEEV7 TAEEV7 **/
#define HRTIM_Common_BMTRGR_TAEEV7		(1 << 27)
/** HRTIM_Common_BMTRGR_TECMP2 TECMP2 **/
#define HRTIM_Common_BMTRGR_TECMP2		(1 << 26)
/** HRTIM_Common_BMTRGR_TECMP1 TECMP1 **/
#define HRTIM_Common_BMTRGR_TECMP1		(1 << 25)
/** HRTIM_Common_BMTRGR_TEREP TEREP **/
#define HRTIM_Common_BMTRGR_TEREP		(1 << 24)
/** HRTIM_Common_BMTRGR_TERST TERST **/
#define HRTIM_Common_BMTRGR_TERST		(1 << 23)
/** HRTIM_Common_BMTRGR_TDCMP2 TDCMP2 **/
#define HRTIM_Common_BMTRGR_TDCMP2		(1 << 22)
/** HRTIM_Common_BMTRGR_TDCMP1 TDCMP1 **/
#define HRTIM_Common_BMTRGR_TDCMP1		(1 << 21)
/** HRTIM_Common_BMTRGR_TDREP TDREP **/
#define HRTIM_Common_BMTRGR_TDREP		(1 << 20)
/** HRTIM_Common_BMTRGR_TDRST TDRST **/
#define HRTIM_Common_BMTRGR_TDRST		(1 << 19)
/** HRTIM_Common_BMTRGR_TCCMP2 TCCMP2 **/
#define HRTIM_Common_BMTRGR_TCCMP2		(1 << 18)
/** HRTIM_Common_BMTRGR_TCCMP1 TCCMP1 **/
#define HRTIM_Common_BMTRGR_TCCMP1		(1 << 17)
/** HRTIM_Common_BMTRGR_TCREP TCREP **/
#define HRTIM_Common_BMTRGR_TCREP		(1 << 16)
/** HRTIM_Common_BMTRGR_TCRST TCRST **/
#define HRTIM_Common_BMTRGR_TCRST		(1 << 15)
/** HRTIM_Common_BMTRGR_TBCMP2 TBCMP2 **/
#define HRTIM_Common_BMTRGR_TBCMP2		(1 << 14)
/** HRTIM_Common_BMTRGR_TBCMP1 TBCMP1 **/
#define HRTIM_Common_BMTRGR_TBCMP1		(1 << 13)
/** HRTIM_Common_BMTRGR_TBREP TBREP **/
#define HRTIM_Common_BMTRGR_TBREP		(1 << 12)
/** HRTIM_Common_BMTRGR_TBRST TBRST **/
#define HRTIM_Common_BMTRGR_TBRST		(1 << 11)
/** HRTIM_Common_BMTRGR_TACMP2 TACMP2 **/
#define HRTIM_Common_BMTRGR_TACMP2		(1 << 10)
/** HRTIM_Common_BMTRGR_TACMP1 TACMP1 **/
#define HRTIM_Common_BMTRGR_TACMP1		(1 << 9)
/** HRTIM_Common_BMTRGR_TAREP TAREP **/
#define HRTIM_Common_BMTRGR_TAREP		(1 << 8)
/** HRTIM_Common_BMTRGR_TARST TARST **/
#define HRTIM_Common_BMTRGR_TARST		(1 << 7)
/** HRTIM_Common_BMTRGR_MSTCMP4 MSTCMP4 **/
#define HRTIM_Common_BMTRGR_MSTCMP4		(1 << 6)
/** HRTIM_Common_BMTRGR_MSTCMP3 MSTCMP3 **/
#define HRTIM_Common_BMTRGR_MSTCMP3		(1 << 5)
/** HRTIM_Common_BMTRGR_MSTCMP2 MSTCMP2 **/
#define HRTIM_Common_BMTRGR_MSTCMP2		(1 << 4)
/** HRTIM_Common_BMTRGR_MSTCMP1 MSTCMP1 **/
#define HRTIM_Common_BMTRGR_MSTCMP1		(1 << 3)
/** HRTIM_Common_BMTRGR_MSTREP MSTREP **/
#define HRTIM_Common_BMTRGR_MSTREP		(1 << 2)
/** HRTIM_Common_BMTRGR_MSTRST MSTRST **/
#define HRTIM_Common_BMTRGR_MSTRST		(1 << 1)
/** HRTIM_Common_BMTRGR_SW SW **/
#define HRTIM_Common_BMTRGR_SW		(1 << 0)

/**@}*/

/** @defgroup hrtim_common_bmcmpr BMCMPR BMCMPR
@{*/


#define HRTIM_Common_BMCMPR_BMCMP_SHIFT		0
#define HRTIM_Common_BMCMPR_BMCMP_MASK		0xffff
/** @defgroup hrtim_common_bmcmpr_bmcmp BMCMP BMCMP
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_common_bmper BMPER Burst Mode Period Register
@{*/


#define HRTIM_Common_BMPER_BMPER_SHIFT		0
#define HRTIM_Common_BMPER_BMPER_MASK		0xffff
/** @defgroup hrtim_common_bmper_bmper BMPER Burst mode Period
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_common_eecr1 EECR1 Timer External Event Control Register 1
@{*/

/** HRTIM_Common_EECR1_EE5FAST External Event 5 Fast mode **/
#define HRTIM_Common_EECR1_EE5FAST		(1 << 29)

#define HRTIM_Common_EECR1_EE5SNS_SHIFT		27
#define HRTIM_Common_EECR1_EE5SNS_MASK		0x03
/** @defgroup hrtim_common_eecr1_ee5sns EE5SNS External Event 5 Sensitivity
@{*/
/**@}*/

/** HRTIM_Common_EECR1_EE5POL External Event 5 Polarity **/
#define HRTIM_Common_EECR1_EE5POL		(1 << 26)

#define HRTIM_Common_EECR1_EE5SRC_SHIFT		24
#define HRTIM_Common_EECR1_EE5SRC_MASK		0x03
/** @defgroup hrtim_common_eecr1_ee5src EE5SRC External Event 5 Source
@{*/
/**@}*/

/** HRTIM_Common_EECR1_EE4FAST External Event 4 Fast mode **/
#define HRTIM_Common_EECR1_EE4FAST		(1 << 23)

#define HRTIM_Common_EECR1_EE4SNS_SHIFT		21
#define HRTIM_Common_EECR1_EE4SNS_MASK		0x03
/** @defgroup hrtim_common_eecr1_ee4sns EE4SNS External Event 4 Sensitivity
@{*/
/**@}*/

/** HRTIM_Common_EECR1_EE4POL External Event 4 Polarity **/
#define HRTIM_Common_EECR1_EE4POL		(1 << 20)

#define HRTIM_Common_EECR1_EE4SRC_SHIFT		18
#define HRTIM_Common_EECR1_EE4SRC_MASK		0x03
/** @defgroup hrtim_common_eecr1_ee4src EE4SRC External Event 4 Source
@{*/
/**@}*/

/** HRTIM_Common_EECR1_EE3FAST External Event 3 Fast mode **/
#define HRTIM_Common_EECR1_EE3FAST		(1 << 17)

#define HRTIM_Common_EECR1_EE3SNS_SHIFT		15
#define HRTIM_Common_EECR1_EE3SNS_MASK		0x03
/** @defgroup hrtim_common_eecr1_ee3sns EE3SNS External Event 3 Sensitivity
@{*/
/**@}*/

/** HRTIM_Common_EECR1_EE3POL External Event 3 Polarity **/
#define HRTIM_Common_EECR1_EE3POL		(1 << 14)

#define HRTIM_Common_EECR1_EE3SRC_SHIFT		12
#define HRTIM_Common_EECR1_EE3SRC_MASK		0x03
/** @defgroup hrtim_common_eecr1_ee3src EE3SRC External Event 3 Source
@{*/
/**@}*/

/** HRTIM_Common_EECR1_EE2FAST External Event 2 Fast mode **/
#define HRTIM_Common_EECR1_EE2FAST		(1 << 11)

#define HRTIM_Common_EECR1_EE2SNS_SHIFT		9
#define HRTIM_Common_EECR1_EE2SNS_MASK		0x03
/** @defgroup hrtim_common_eecr1_ee2sns EE2SNS External Event 2 Sensitivity
@{*/
/**@}*/

/** HRTIM_Common_EECR1_EE2POL External Event 2 Polarity **/
#define HRTIM_Common_EECR1_EE2POL		(1 << 8)

#define HRTIM_Common_EECR1_EE2SRC_SHIFT		6
#define HRTIM_Common_EECR1_EE2SRC_MASK		0x03
/** @defgroup hrtim_common_eecr1_ee2src EE2SRC External Event 2 Source
@{*/
/**@}*/

/** HRTIM_Common_EECR1_EE1FAST External Event 1 Fast mode **/
#define HRTIM_Common_EECR1_EE1FAST		(1 << 5)

#define HRTIM_Common_EECR1_EE1SNS_SHIFT		3
#define HRTIM_Common_EECR1_EE1SNS_MASK		0x03
/** @defgroup hrtim_common_eecr1_ee1sns EE1SNS External Event 1 Sensitivity
@{*/
/**@}*/

